/* 
  Localizable.strings
  JYAuthorizationBundle

  Created by dqh on 2019/3/12.
  Copyright © 2019 dqh. All rights reserved.
*/

"ok" = "确认";
"go" = "前往";

// 定位
"location.description" = "定位验证错误";
"location.notdetermind" = "用户尚未决定应用是否可以访问定位服务";
"location.restricted" = "应用无权使用定位服务，且无法更改这一状态";
"location.unserviced" = "本设备尚未启用定位服务，您可前往【设置->隐私->定位服务】，启用定位服务";

"location.always.denied" = "你已拒绝开启【定位-始终使用】服务，如需开启，请前往【设置->隐私->定位服务】进行设置";
"location.wheninuse.denied" = "你已拒绝开启【定位-应用使用期间】服务，如需开启，请前往【设置->隐私->定位服务】进行设置";
"location.always.wheninuse" = "您已开启【定位-始终使用】服务，如仅需要在使用应用期间使用，请前往【设置->隐私->定位服务】进行设置";
"location.wheninuse.always" = "您被允许在应用使用期间使用服务，如需要始终使用定位服务，请前往【设置->隐私->定位服务】进行设置";

// 通讯录
"addressbook.description" = "通讯录验证错误";
"addressbook.notdetermind" = "用户尚未决定应用是否可以访问通讯录服务";
"addressbook.restricted" = "应用无权使用通讯录服务，且无法更改这一状态";
"addressbook.denied" = "你已拒绝开启通讯录服务，如需开启，请前往【设置->隐私->通讯录】进行设置";

// 日历
"calendar.description" = "日历验证错误";
"calendar.notdetermind" = "用户尚未决定应用是否可以访问日历服务";
"calendar.restricted" = "应用无权使用日历服务，且无法更改这一状态";
"calendar.denied" = "你已拒绝开启日历服务，如需开启，请前往【设置->隐私->日历】进行设置";

// 提醒
"reminder.description" = "提醒验证错误";
"reminder.notdetermind" = "用户尚未决定应用是否可以访问提醒服务";
"reminder.restricted" = "应用无权使用提醒服务，且无法更改这一状态";
"reminder.denied" = "你已拒绝开启提醒服务，如需开启，请前往【设置->隐私->提醒】进行设置";

// 相册
"photo.description" = "相册验证错误";
"photo.notdetermind" = "用户尚未决定应用是否可以访问相册服务";
"photo.restricted" = "应用无权使用相册服务，且无法更改这一状态";
"photo.denied" = "你已拒绝开启相册服务，如需开启，请前往【设置->隐私->相册】进行设置";

// 麦克风
"microphone.description" = "麦克风验证错误";
"microphone.notdetermind" = "用户尚未决定应用是否可以访问麦克风服务";
"microphone.restricted" = "应用无权使用麦克风服务，且无法更改这一状态";
"microphone.denied" = "你已拒绝开启麦克风服务，如需开启，请前往【设置->隐私->麦克风】进行设置";

// 相机
"camera.description" = "相机验证错误";
"camera.notdetermind" = "用户尚未决定应用是否可以访问相机服务";
"camera.restricted" = "应用无权使用相机服务，且无法更改这一状态";
"camera.denied" = "你已拒绝开启相机服务，如需开启，请前往【设置->隐私->相机】进行设置";


// 语音识别
"speechrecognition.description" = "语音识别验证错误";
"speechrecognition.notdetermind" = "用户尚未决定应用是否可以访问语音识别服务";
"speechrecognition.restricted" = "应用无权使用语音识别服务，且无法更改这一状态";
"speechrecognition.denied" = "你已拒绝开启语音识别服务，如需开启，请前往【设置->隐私->语音识别】进行设置";
"speechrecognition.lowversion" = "当前服务仅支持iOS10.0及以上的系统";

// 健康
"health.description" = "健康验证错误";
"health.notdetermind" = "用户尚未决定应用是否可以访问健康服务";
"health.restricted" = "应用无权使用健康服务，且无法更改这一状态";
"health.denied" = "你已拒绝开启健康服务，如需开启，请前往【设置->隐私->健康】进行设置";
"health.unserviced" = "本设备尚未启用健康服务，您可前往【设置->隐私->健康】，启用健康服务";
